
/** Минимальное количество игроков, необходимое для начала игры */
export const BOX_GAME_MIN_PLAYERS_TO_START = 100

/** Время на то, чтобы хоть кто то взял сумку (в секундах) */
export const BOX_GAME_TIME_FROM_START = 600 // секунд

/** Время на то, чтобы после первого поднятия сумки ее довезли до места назначения (в секундах) */
export const BOX_GAME_TIME_FOR_ROAD = 1200 // секунд

/**
 * Интервал в минутах, через который начинается рандомным образом игра
 * Если установлено 0, то игра автоматически не начнется
 */
export const BOX_GAME_START_TRY_INTERVAL = 0 // минут


/**
 * Предметы, которые случайным образом выпадают в награде
 * wear не трогать
 * money выберется случайное значение из массива (деньги)
 * coins тоже что и money только койны
 * 
 * Новые значения кроме money, coins, wear ничего не изменят, логика сделана только под существующие
 * 
 * PERCENT ВСЕХ В СУММЕ ДОЛЖЕН БЫТЬ 100 %
*/
export const BOX_GAME_WINS_VALUES = {
  'money': {
    items: [30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000],
    percent: 45
  },
  'coins': {
    items: [50, 100, 150, 200],
    percent: 45
  }
}


/** Точки, куда нужно отвезти сумку, координаты обычные */
export const BOX_GAME_POS_END: { x: number, y: number, z: number }[] = [
  {x: -757.84, y: -1046.36, z: 12.51},
  {x: -243.48, y: -258.76, z: 36.65},
  {x: -25.23, y: -226.72, z: 45.18},
  {x: 1620.96, y: -2254.77, z: 107.02},
  {x: 1508.53, y: -2151.79, z: 77.40},
  {x: 1482.60, y: -1918.69, z: 71.37},
  {x: 1657.96, y: -1844.62, z: 109.20},
  {x: 1745.06, y: -1475.50, z: 112.85},
  {x: 2954.17, y: 1011.92, z: 9.96},
  {x: 2468.31, y: 1461.69, z: 36.20},
  {x: 2852.84, y: 1502.85, z: 24.70},
  {x: 2628.37, y: 2935.43, z: 40.42},
  {x: 2747.49, y: 3469.56, z: 55.68},
  {x: 2708.48, y: 3451.81, z: 55.58},
  {x: 2677.05, y: 3500.98, z: 53.30},
  {x: 2893.44, y: 3736.14, z: 44.20},
  {x: 2663.20, y: 3926.25, z: 42.41},
  {x: 2457.01, y: 4058.20, z: 38.06},
  {x: 2483.30, y: 4099.14, z: 38.08},
  {x: 2504.80, y: 4098.07, z: 38.51},
  {x: 2866.40, y: 4413.58, z: 49.12},
  {x: 2835.35, y: 4569.62, z: 46.53},
  {x: 2874.56, y: 4869.08, z: 62.63},
  {x: 2194.37, y: 5596.08, z: 53.76},
  {x: 501.88, y: 5604.63, z: 797.91},
  {x: -339.81, y: 3740.78, z: 69.97},
  {x: -106.95, y: 2795.82, z: 53.32},
  {x: -285.21, y: 2538.58, z: 74.66},
  {x: -128.21, y: 1924.36, z: 197.27},
  {x: -52.40, y: 1910.98, z: 195.36},
  {x: -533.62, y: 5289.33, z: 74.18},
  {x: -526.10, y: 5336.87, z: 80.26},
  {x: -553.16, y: 5325.77, z: 73.60},
  {x: -477.24, y: 5517.35, z: 80.00},
  {x: -738.22, y: 5572.38, z: 36.71},
  {x: -688.07, y: 5788.48, z: 17.33},
  {x: -481.92, y: 6264.71, z: 13.27},
  {x: -305.18, y: 6283.39, z: 31.49},
  {x: -115.55, y: 6244.91, z: 31.33},
  {x: -107.34, y: 6245.99, z: 31.35},
  {x: 109.38, y: 6323.89, z: 31.39},
  {x: 137.93, y: 6641.79, z: 31.73},
  {x: 133.39, y: 6636.94, z: 31.78},
  {x: 149.24, y: 6645.72, z: 31.61},
  {x: 155.36, y: 6658.24, z: 31.55},
  {x: 175.14, y: 6644.22, z: 31.54}
]

/** Точки, где появляются сумки при начале игры, координаты обычные */
export const BOX_GAME_POS_START: { x: number, y: number, z: number }[] = [
  {x:772.82,y:-1511.68,z:20.49},
  {x:939.62,y:-1798.74,z:30.95},
  {x:1296.56,y:-1930.60,z:43.26},
  {x:1603.48,y:-1708.68,z:88.12},
  {x:1205.17,y:-1231.52,z:35.22},
  {x:565.23,y:-1610.74,z:27.78},
  {x:-6.56,y:-1049.97,z:38.15},
  {x:-971.58,y:-1455.50,z:5.17},
  {x:-1275.09,y:-804.53,z:17.33},
  {x:-1635.78,y:-382.55,z:43.38},
  {x:735.81,y:2517.96,z:73.23},
  {x:-1482.73,y:2119.92,z:46.91},
  {x:-1422.66,y:-207.66,z:46.50},
  {x:-690.38,y:-574.08,z:31.55},
  {x:136.85,y:-1172.41,z:29.31},
  {x:1720.77,y:-1468.92,z:112.89},
  {x:1261.89,y:336.17,z:85.99},
  {x:1271.60,y:329.21,z:85.99},
  {x:-271.96,y:1042.37,z:235.33},
  {x:-664.68,y:2449.47,z:48.58},
  {x:-226.04,y:3857.56,z:31.44},
  {x:348.24,y:4446.63,z:63.00},
  {x:713.05,y:4101.20,z:35.79},
  {x:1703.35,y:4819.93,z:41.98},
  {x:2867.58,y:4410.97,z:49.16},
  {x:3607.49,y:3646.99,z:41.34},
  {x:3854.35,y:4463.30,z:2.73},
  {x:2599.65,y:5499.86,z:47.79},
  {x:2301.66,y:5984.57,z:54.28},
  {x:1742.15,y:6409.80,z:35.06},
  {x:436.98,y:6501.85,z:28.81}
]


