
/** Минимальное количество членов семей для начала Борьбы за груз. */
export const FamilyCargoStartMembers = 2//3
/** Минимальное количество семей с минимальным количеством членов семей (значение выше) для начала Борьбы за груз */
export const FamilyCargoStartFamilies = 2//2
/** Время на подготовку семей, в минутах */
export const FamilyCargoTime = 10

export const FamilyCargoStages = {
    STAGE_NONE: 1,
    STAGE_FREEZE: 2,
    STAGE_ATTACK: 3
}

/** Количество минут с невозможностью семье участвовать в борьбе за груз после победы */
export const FAMILY_TIMEOUT_AFTER_CARGO_BATTLE = 60*5

/** Количество очков, делимое на игроков во время битвы за груз
 * Всего 100 делений, то есть если значение = 1, то в сумме игроки, участвовавшие в битве от семьи получат 100 очков семьи
 * И семья тоже получит очков = значение умноженное на 100 */
export const FAMILY_CARGO_POINTS_FOR_ONE_TICK = 3

/** Количество груза, получаемое семьей за победу в захвате груза (в кг) */
export const FAMILY_CARGO_VALUE_FOR_WIN = 3000


/** Дистанция захвата груза (оптимальное значение = 50) */
export const FAMILY_CARGO_DISTANCE = 170

/** Минимальное время между автоматическими запусками Борьбы за груз (в минутах)
 * Если установлено значение 0 - игра автоматически не запустится
 * Значение по умолчанию: 60*3 (3 часа)
 * Если недостаточно семей/игроков, то таймер повторится через 20 минут */
export const FAMILY_CARGO_TIME_TO_TIMER = 0// 60*3

/** Рандомные обьекты для семейных боев за груз */
export const CARGOBATTLE_OBJECTS:
        { model:number | string, x: number, y: number, z: number, rx :number, ry: number, rz: number }[] = [
    {
        "model": "pp_containeronyx",
        "x": 1448.9803466796875,
        "y": -1691.6434326171875,
        "z": 66.72200775146484,
        "rx": -3.228348731994629,
        "ry": 1.336141650654099,
        "rz": 2.047194242477417
    },
    {
        "model": "pp_containeronyx",
        "x": 2665.065185546875,
        "y": 1408.3306884765625,
        "z": 24.87902069091797,
        "rx": 0,
        "ry": 0,
        "rz": -16.500097274780273
    },
    {
        "model": "pp_containeronyx",
        "x": 2709.677001953125,
        "y": 2854.109619140625,
        "z": 38.88386535644531,
        "rx": -2.169280767440796,
        "ry": 7.519629955291748,
        "rz": 57.63758087158203
    },
    {
        "model": "pp_containeronyx",
        "x": 2415.127685546875,
        "y": 3057.440673828125,
        "z": 48.49504470825195,
        "rx": 0,
        "ry": 0,
        "rz": 17.362144470214844
    },
    {
        "model": "pp_containeronyx",
        "x": 1739.00732421875,
        "y": 2837.101806640625,
        "z": 42.8490104675293,
        "rx": 0,
        "ry": 0,
        "rz": -60.43278121948242
    },
    {
        "model": "pp_containeronyx",
        "x": 1445.5234375,
        "y": 2893.406982421875,
        "z": 47.892417907714844,
        "rx": -4.921261787414551,
        "ry": -2.4015698432922363,
        "rz": 0

    },
    {
        "model": "pp_containeronyx",
        "x": 774.7483520507812,
        "y": 3581.991455078125,
        "z": 32.5422477722168,
        "rx": 0.1985706090927124,
        "ry": 0,
        "rz": -65.0484390258789
    },
    {
        "model": "pp_containeronyx",
        "x": 1255.94189453125,
        "y": 4395.193359375,
        "z": 43.90522766113281,
        "rx": -4.293940544128418,
        "ry": -4.043604373931885,
        "rz": -5.134772777557373
    },
    {
        "model": "pp_containeronyx",
        "x": -397.2535400390625,
        "y": 4328.943359375,
        "z": 56.74571990966797,
        "rx": 3.010317325592041,
        "ry": 9.53088092803955,
        "rz": -15.69547176361084
    },
    {
        "model": "pp_containeronyx",
        "x": -3.5007011890411377,
        "y": 2925.00830078125,
        "z": 57.27580642700195,
        "rx": -3.716099977493286,
        "ry": -0.9882188439369202,
        "rz": 2.3012309074401855
    },
    {
        "model": "pp_containeronyx",
        "x": 1068.7000732421875,
        "y": 2300.219970703125,
        "z": 45.88756561279297,
        "rx": 0.37795525789260864,
        "ry": -1.5903119817664742,
        "rz": -90
    },
    {
        "model": "pp_containeronyx",
        "x": 1269.53369140625,
        "y": 1816.372802734375,
        "z": 83.59292602539062,
        "rx": -1.1506202220916748,
        "ry": -6.501245975494385,
        "rz": -0.18007919192314148
    },
    {
        "model": "pp_containeronyx",
        "x": 1621.0147705078125,
        "y": 2134.547607421875,
        "z": 80.22152709960938,
        "rx": -1.5015058517456055,
        "ry": 1.9958070516586304,
        "rz": 54.412078857421875
    },
    {
        "model": "pp_containeronyx",
        "x": 2135.03466796875,
        "y": 1789.5146484375,
        "z": 104.29984283447266,
        "rx": 0.0012640384957194328,
        "ry": -3.999840021133423,
        "rz": 4.465108394622803
    },
    {
        "model": "pp_containeronyx",
        "x": 1888.642578125,
        "y": 328.7004089355469,
        "z": 163.06044006347656,
        "rx": 1.4999994039535522,
        "ry": 0,
        "rz": 0
    },
    {
        "model": "pp_containeronyx",
        "x": 964.4987182617188,
        "y": 3567.791748046875,
        "z": 33.86485290527344,
        "rx": -0.9999997019767761,
        "ry": 3.499999523162842,
        "rz": 48.999820709228516
    },
    {
        "model": "pp_containeronyx",
        "x": 1644.7801513671875,
        "y": 6609.9931640625,
        "z": 22.935958862304688,
        "rx": -17.531944274902344,
        "ry": -7.385069847106934,
        "rz": 2.3638222217559814
    },
    {
        "model": "pp_containeronyx",
        "x": 601.4368896484375,
        "y": 6651.68408203125,
        "z": 11.120121002197266,
        "rx": -4.998624801635742,
        "ry": 4.504117012023926,
        "rz": 0.5525332689285278
    },
    {
        "model": "pp_containeronyx",
        "x": -1317.15869140625,
        "y": 4443.68212890625,
        "z": 23.55460548400879,
        "rx": -12.50828783416748,
        "ry": 6.953901767730713,
        "rz": 0.3037002682685852
    }
]