//! Использовать координаты плоского маркера
/** Точки штрафстоянок */
export const FINE_CAR_POS:{x: number, y: number, z: number, h: number}[] = [
    { x: 376.16, y: -1612.22, z: 28.39, h: 233},
    { x: 360.73, y: 293.75, z: 102.62, h: 246},
    { x: 1664.37, y: 3830.58, z: 33.99, h: 213},
    { x: -441.44, y: 6143.92, z: 30.58, h: 227}

]
/** Точки авиаштрафстоянок */
export const FINE_AIR_POS:{x: number, y: number, z: number, h: number}[] = [
    {x: -1339.60, y: -2727.40, z: 13.04, h: 146}

]