import { LEVEL_PERMISSIONS } from "./level.permissions";

/** Какой уровень игрока требуется для доступа */
export const GR6_LEVEL_ACCESS = LEVEL_PERMISSIONS.GR6;
/** Модель транспорта  */
export const GR6_VEH_MODEL: string = "stockade";
/** Стоимость залога транспорта */
export const GR6_VEH_COST = 5000;
/** Какой процент от залога вернуть при возврате. Если 0 - не возвращать средства вообще */
export const GR6_VEH_COST_RETURN = 90;
/** Сколько заданий выдаётся транспорту. Если свободных точек в таком количестве не будет - будет выдано меньше */
export const GR6_TASKS_COUNT = 10;
/** Местоположение точки где берутся задания, обмундирование и сдаются деньги. Указывайте координаты для плоского маркера */
export const GR6_BASE_POS = new mp.Vector3(484.59, -1094.22, 28.50);
/** Диапазон средств, которые даются с одного маркера */
export const GR6_MONEY_GIVE_RANGE: [number, number] = [10000, 50000];
/** Сколько процентов от суммы в ТС даётся команде. Деньги делятся поровну на всех. Значение от 1 до 100 */
export const GR6_MONEY_REWARD_PERCENT = 7;
/** Местоложение меток где арендовать транспорт. Указывайте координаты для плоского маркера */
export const GR6_VEH_BUY_POSITION: Vector3Mp[] = [
    new mp.Vector3(479.11, -1100.78, 28.30),
];
/** Наименования задания в навигаторе */
export const GR6_GPS_TASK_NAME = 'Задание Gruupe Sechs'
/** Местоложение точек для сбора средств. 
 * Для нормальной работы нужно 50-100 точек. А вообще чем больше - тем лучше. 
 * Указывайте координаты плоского маркера. Места необходимо подбирать такие, чтобы они максимально были не заметны, то есть не в дверях и т.д. 
 * Идеал - подвалы, коморки, сервисные зоны магазинов и прочее. Маркеры будут видеть все игроки, но взаимодействовать смогут только члены отряда,\
 *  которому выдали задания на эти точки */
export const GR6_POINTS_GRAB: Vector3Mp[] = [
    // Аптеки
    new mp.Vector3(326.25, -1078.31, 28.58),
    new mp.Vector3(296.29, -731.47, 28.45),
    new mp.Vector3(91.63, -230.97, 53.76),
    // new mp.Vector3(-252.98, 6337.40, 31.53),
    // Fleece Bank
    // new mp.Vector3(129.87, -1038.62, 28.53),
    // new mp.Vector3(322.13, -305.04, 51.81),
    // new mp.Vector3(-348.26, -45.84, 53.52),
    // new mp.Vector3(-1212.16, -336.19, 36.89),
    // new mp.Vector3(1184.38, 2722.59, 37.72),
    // new mp.Vector3(-2946.70, 483.41, 14.36),
    // Blaine County Bank
    new mp.Vector3(-114.03, 6473.62, 30.73),
    // Pacific Bank
    new mp.Vector3(255.09, 228.25, 105.39),
    // AmmuNation
    new mp.Vector3(-331.13, 6086.02, 30.55),
    new mp.Vector3(1692.75, 3762.08, 33.81),
    new mp.Vector3(-1118.46, 2700.72, 17.65),
    new mp.Vector3(-3173.42, 1089.53, 19.94),
    new mp.Vector3(-1303.90, -395.73, 35.80),
    new mp.Vector3(253.83, -51.80, 69.04),
    new mp.Vector3(-661.36, -933.29, 20.93),
    // new mp.Vector3(23.91, -1105.57, 28.90),
    new mp.Vector3(809.35, -2159.44, 28.72),
    new mp.Vector3(841.13, -1035.74, 27.29),
    // АвтоСалоны    
    new mp.Vector3(-65.63, 78.01, 70.72),
    new mp.Vector3(-29.32, -1103.51, 25.52),
    new mp.Vector3(-33.67, -1676.80, 28.59),
    // Парикмахерские
    new mp.Vector3(1226.14, -481.74, 65.55),
    new mp.Vector3(135.02, -1708.12, 28.39),
    new mp.Vector3(-278.04, 6229.89, 30.80),
    new mp.Vector3(1931.12, 3728.82, 31.94),
    
    // <Ювелирка>
    new mp.Vector3(-631.04, -229.45, 37.16),
    // 24/7
    new mp.Vector3(1160.10, -316.82, 68.31),
    new mp.Vector3(30.73, -1339.59, 28.60),
    new mp.Vector3(-45.14, -1750.54, 28.52),
    new mp.Vector3(-709.57, -907.05, 18.32),
    new mp.Vector3(1126.86, -980.88, 44.52),
    new mp.Vector3(378.08, 332.99, 102.67),
    new mp.Vector3(-1479.31, -374.84, 38.26),
    new mp.Vector3(-1828.95, 799.04, 137.28),
    new mp.Vector3(-3047.36, 585.78, 7.01),
    new mp.Vector3(-2959.49, 387.76, 13.14),
    new mp.Vector3(1734.76, 6420.41, 34.14),
    new mp.Vector3(1707.59, 4920.11, 41.16),
    new mp.Vector3(2673.15, 3286.39, 54.34),
    new mp.Vector3(1959.54, 3748.49, 31.44),
    new mp.Vector3(1168.72, 2717.83, 36.26),
    new mp.Vector3(1395.30, 3613.04, 34.08),
    new mp.Vector3(546.33, 2663.22, 41.26),
    new mp.Vector3(2549.65, 384.87, 107.72),
    new mp.Vector3(-1220.37, -915.71, 10.43),
    // Digital Den
    new mp.Vector3(1129.16, -474.23, 65.82),
    new mp.Vector3(-660.32, -861.38, 23.59),
    // Заправки без 24/7
    new mp.Vector3(-79.77, 6415.37, 30.74),
    new mp.Vector3(1203.65, -1382.27, 34.33),
    new mp.Vector3(167.73, -1708.47, 28.39),
    new mp.Vector3(294.35, -1250.80, 28.44),
    new mp.Vector3(-356.39, -1486.54, 29.26),
    new mp.Vector3(-545.38, -1227.19, 17.55),
    new mp.Vector3(818.14, -1040.61, 25.85),
    new mp.Vector3(-2066.11, -311.90, 12.32),
    new mp.Vector3(-1432.64, -252.47, 45.46),
    new mp.Vector3(660.55, 263.63, 101.77),
    new mp.Vector3(1189.58, 2651.03, 36.94),
    new mp.Vector3(263.46, 2591.71, 44.05),
    new mp.Vector3(-2554.33, 2300.45, 32.32),
    new mp.Vector3(175.09, 6643.11, 30.67),
    new mp.Vector3(59.41, 2795.61, 56.98),
    new mp.Vector3(1764.02, 3320.12, 40.50),
    // Магазины одежды
    new mp.Vector3(6.20, 6508.42, 30.98),
    new mp.Vector3(1702.15, 4829.54, 41.08),
    new mp.Vector3(1194.37, 2722.88, 37.72),
    new mp.Vector3(614.54, 2785.05, 42.58),
    new mp.Vector3(-1108.23, 2723.39, 17.90),
    new mp.Vector3(-3169.42, 1033.55, 19.93),
    new mp.Vector3(-1444.63, -257.74, 45.31),
    new mp.Vector3(-1180.60, -752.09, 18.64),
    new mp.Vector3(-833.50, -1071.28, 10.75),
    new mp.Vector3(-700.02, -146.60, 36.95),
    new mp.Vector3(-167.75, -300.96, 38.83),
    new mp.Vector3(121.46, -241.28, 52.46),
    new mp.Vector3(429.44, -808.03, 28.59),
    new mp.Vector3(66.77, -1398.79, 28.46),
    // LSC
    new mp.Vector3(99.45, 6621.01, 31.54),
    new mp.Vector3(-1140.49, -2006.37, 12.28),
    new mp.Vector3(-197.43, -1317.54, 30.19),
    // new mp.Vector3(472.30, -1309.53, 28.33),
    new mp.Vector3(726.82, -1066.64, 27.41),
    new mp.Vector3(-344.81, -123.44, 38.11),
    new mp.Vector3(1187.34, 2637.11, 37.50),
    // Тату Салоны
    new mp.Vector3(-305.55, 6197.32, 30.59),
    new mp.Vector3(1867.09, 3760.30, 32.11),
    new mp.Vector3(-3175.01, 1075.18, 19.93),
    new mp.Vector3(321.71, 185.17, 102.69),
    new mp.Vector3(1327.47, -1654.10, 51.38),
    new mp.Vector3(-1149.66, -1427.97, 4.05),
    // Рандомные места
    new mp.Vector3(68.56, 126.15, 78.29),
    new mp.Vector3(84.42, 190.20, 104.36),
    new mp.Vector3(310.11, 202.43, 103.45),
    new mp.Vector3(-1327.23, -189.77, 46.99),
    new mp.Vector3(-1585.97, -837.65, 9.05),
    new mp.Vector3(-1668.30, -995.27, 7.26),
    new mp.Vector3(-830.69, -1256.17, 5.68),
    new mp.Vector3(-242.54, -1995.41, 24.88)
];

export const GR6_DRESS_CONFIG_MAN: [number, number, number][] = [
    [3, 48, 0],
    [8, 152, 0],
    [11, 95, 0],
    [4, 47, 0],
    [6, 25, 0],
    
]
export const GR6_DRESS_CONFIG_WOMAN: [number, number, number][] = [
    [3, 54, 0],
    [8, 188, 0],
    [11, 352, 4],
    [4, 49, 0],
    [6, 25, 0],
]