export const UdoData: { id: number, pic: string, class: string}[] = [
    {id:4, pic:"army-logo", class: "army"},
    {id:5, pic:"news-logo", class: "lifenews"},
    {id:16, pic:"ems-logo", class: "ems"},
    {id:1, pic:"goverment-logo", class: "depart"},
    {id:7, pic:"sheriff-logo", class: "sheriff"},
    {id:2, pic:"police-logo", class: "lspd"},
    {id:3, pic:"fib-logo", class: "fib"},
];

export interface UdoTypeBase {
    user: number,
    tag: string,
    player: string,  // Никнейм
    fraction: number,
    rank: number,
}

export interface ILicenceGetDataStore {
    type: LicenceType,   // Тип
    time: number,   // Срок действия
    serial: number, // Номер лицензии/аккаунта
    player: string,  // Никнейм
    code: string,  // Никнейм
    close?: () => any
}


export type LicenceType = keyof typeof LicenseName;

/** Требуется ли для покупки бизнеса лицензия */
export const BUSINESS_BUY_NEED_LICENSE = false;

/** Минимальный ранг который требуется чтобы изъять лицензию */
export const REMOVE_LICENSE_RANK = 7;

export const LicenseName = {
    car: "Авто транспорт",
    moto: "Мото транспорт",
    air: "Воздушный транспорт",
    boat: "Водный транспорт",
    truck: "Грузовой транспорт",
    weapon: "Ношение/Хранение оружия",
    fishrod: "Ловля рыбы",
    fishsell: "Продажа рыбы",
    biz: "Владение бизнесом",
    med: "Медицинская страховка",
    advokat: "Адвоката",
    military: "Военный билет",
    hunting: "Разрешение на охоту",
    reanimation: "Курсы оказания первой мед помощи"
}

export const LicensesData: { id: LicenceType, name: string, ex?: string, pic: string, gradient: string, shadow: [string, string]}[] = [
    { id: "car", name: "Автомобильный Транспорт", ex: "B", pic: 'lic_1', gradient: '99,70,255', shadow: ['19, 18, 52, 0.75', '2, 0, 44, 0.51'] },
    { id: "moto", name: "Мото Транспорт", ex: "A", pic: 'lic_1', gradient: '99,70,255', shadow: ['19, 18, 52, 0.75', '2, 0, 44, 0.51'] },
    { id: "truck", name: "Грузовой Транспорт", ex: "C", pic: 'lic_3', gradient: '255,70,70', shadow: ['52, 18, 18, 0.75', '44, 0, 0, 0.51'] },
    { id: "boat", name: "Водный Транспорт", ex: "W", pic: 'lic_2', gradient: '70,157,255', shadow: ['18, 37, 52, 0.75', '0, 25, 44, 0.51'] },
    { id: "air", name: "Воздушный Транспорт", ex: "F", pic: 'lic_3', gradient: '255,70,70', shadow: ['52, 18, 18, 0.75', '44, 0, 0, 0.51'] },
    { id: "weapon", name: "Оружие", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "fishrod", name: "Ловля рыбы", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "fishsell", name: "Продажа рыбы", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "biz", name: "Владение бизнесом", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "med", name: "Медицинская страховка", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "advokat", name: "Адвокатская лицензия", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "military", name: "Военный билет", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "hunting", name: "Разрешение на охоту", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] },
    { id: "reanimation", name: "Курсы оказания первой мед помощи", pic: 'lic_4', gradient: '148,255,70', shadow: ['37, 52, 18, 0.75', '16, 44, 0, 0.51'] }
];



/** Сколько секунд даётся на экзамен по стрельбе */
export const licenseShootTimer = 15;

/** Список лицензионных центров для получения лицензии.
 *! @warning В данный файл конфигурации необходимо вносить исключительно точки получения водительских прав
 */
export const LICENCE_CENTER_LIST: {
    /** Маркер взаимодействия */
    point: { x: number, y: number, z: number },
    /** Стартовая точка */
    start: { x: number, y: number, z: number, h: number },
    /** Точки маршрута */
    points: { x: number, y: number, z: number, h: number }[],
    /** Список выдаваемых лицензий [Лицензия, Стоимость, Стоимость восстановления документа, Сток выдачи в IRL днях] */
    license: {
        /** ID лицензии */
        id: LicenceType,
        /** Стоимость выдачи */
        cost: number,
        /** Стоимость восстановления или продления */
        restore: number,
        /** Количество дней которое новый документ является действительным */
        time: number,
        /** Необходима теория. Просто так кому попало не прописывать */
        needTheory?: true,
        /**Модели транспорта для сдачи экзамена*/
        models?: string[],
        /** ID Предметов оружия */
        guns?: number[],
        /** Требуется какой либо документ, который оформлен на имя игрока чтобы получить данную лицензию */
        need_document?:string
        /** Если требуется документ, то он должен быть выдан не позднее чем указанное количество дней */
        need_document_days?:number
        /** При использовании документа будет ли он уничтожен */
        need_document_remove?:boolean
    }[],
    /** Иконка на карте, если требуется */
    icon?: number,
    /** Название маркера и иконки на карте */
    name: string,
    /** Параметр, который отвечает за то, что нужна системная обработка получения лицензии */
    auto?: true

}[] = [
        {
            auto: true,
            point: { x: -700.80, y: -1310.46, z: 4.11 },
            start: { x: -757.19, y: -1292.35, z: 5.00, h: 297 },
            points: [
                { x: -749.35, y: -1288.26, z: 4.58, h: 302.64 },
                { x: -685.75, y: -1253.73, z: 10.08, h: 212.77 },
                { x: -656.79, y: -1326.06, z: 10.04, h: 194.47 },
                { x: -662.91, y: -1493.65, z: 10.23, h: 173.14 },
                { x: -744.84, y: -1614.11, z: 23.97, h: 136.86 },
                { x: -768.57, y: -1732.20, z: 28.74, h: 184.89 },
                { x: -723.85, y: -1874.55, z: 26.77, h: 211.02 },
                { x: -121.97, y: -2090.04, z: 25.00, h: 288.79 },
                { x: 166.97, y: -2016.37, z: 17.66, h: 337.73 },
                { x: 187.17, y: -1898.22, z: 23.14, h: 64.40 },
                { x: 113.22, y: -1845.48, z: 24.97, h: 318.92 },
                { x: 154.04, y: -1796.07, z: 28.37, h: 320.28 },
                { x: 151.24, y: -1744.63, z: 28.63, h: 52.21 },
                { x: 19.21, y: -1684.41, z: 28.82, h: 110.56 },
                { x: -85.97, y: -1722.75, z: 28.76, h: 110.75 },
                { x: -193.75, y: -1785.60, z: 29.34, h: 120.50 },
                { x: -278.63, y: -1826.10, z: 26.72, h: 98.38 },
                { x: -419.01, y: -1844.84, z: 19.64, h: 120.04 },
                { x: -536.05, y: -1936.06, z: 16.82, h: 132.51 },
                { x: -733.78, y: -2144.33, z: 13.05, h: 138.20 },
                { x: -835.64, y: -2234.49, z: 17.01, h: 131.35 },
                { x: -1079.21, y: -2598.71, z: 19.63, h: 150.81 },
                { x: -873.34, y: -2656.26, z: 18.58, h: 330.36 },
                { x: -760.83, y: -2454.80, z: 13.83, h: 330.98 },
                { x: -751.43, y: -2356.88, z: 14.38, h: 44.60 },
                { x: -1055.88, y: -2053.76, z: 12.69, h: 42.63 },
                { x: -1049.70, y: -1912.89, z: 12.55, h: 312.24 },
                { x: -891.62, y: -1754.20, z: 18.43, h: 317.79 },
                { x: -775.24, y: -1621.51, z: 14.20, h: 316.57 },
                { x: -690.22, y: -1484.54, z: 10.50, h: 318.98 },
                { x: -646.95, y: -1423.44, z: 10.15, h: 355.91 },
                { x: -637.81, y: -1331.90, z: 10.14, h: 345.21 },
                { x: -639.60, y: -1276.33, z: 10.09, h: 42.22 },
                { x: -698.96, y: -1205.36, z: 10.15, h: 39.17 },
                { x: -754.96, y: -1132.59, z: 10.15, h: 27.46 },
                { x: -764.93, y: -1137.34, z: 10.15, h: 212.17 },
                { x: -721.17, y: -1203.64, z: 10.08, h: 220.85 },
                { x: -716.42, y: -1247.66, z: 9.02, h: 135.54 },
                { x: -743.76, y: -1310.89, z: 4.49, h: 228.74 }
            ],
        license: [{ id: "car", cost: 2000, restore: 750, time: 30, models: ["asea"], needTheory: true },
            { id: "moto", cost: 1000, restore: 500, time: 30, models: ["bati"], needTheory: true },
            { id: "truck", cost: 5000, restore: 2500, time: 30, models: ["benson"], needTheory: true }
            ],
            icon: 77,
            name: "Лицензии для Мото и транспорта"
        },
        {
            auto: true,
            point: { x: -777.67, y: -1324.20, z: 4.15 },
            start: { x: -736.07, y: -1341.59, z: 1.00, h: 104 },
            points: [
                { x: -843.48, y: -1525.57, z: 0.14, h: 149.43 },
                { x: -910.32, y: -1590.67, z: 0.28, h: 142.54 },
                { x: -945.25, y: -1655.67, z: 0.42, h: 148.66 },
                { x: -1069.05, y: -1738.77, z: 0.70, h: 133.95 },
                { x: -1138.70, y: -1840.83, z: 0.58, h: 133.80 },
                { x: -1273.70, y: -1934.28, z: 0.48, h: 131.02 },
                { x: -1347.04, y: -1981.59, z: 0.39, h: 84.10 },
                { x: -1331.44, y: -1941.09, z: 0.87, h: 317.14 },
                { x: -1297.82, y: -1828.76, z: 0.30, h: 26.98 },
                { x: -1488.59, y: -1530.33, z: 1.17, h: 33.75 },
                { x: -1579.48, y: -1374.20, z: 0.54, h: 21.79 },
                { x: -1642.26, y: -1334.37, z: 0.12, h: 88.20 },
                { x: -1787.58, y: -1242.00, z: 1.77, h: 145.74 },
                { x: -1860.76, y: -1251.47, z: 0.83, h: 38.11 },
                { x: -1872.78, y: -1190.86, z: 0.06, h: 302.63 },
                { x: -1819.45, y: -1144.71, z: 0.10, h: 285.08 },
                { x: -1909.39, y: -1014.61, z: 0.22, h: 83.51 },
                { x: -1963.31, y: -1010.81, z: 0.72, h: 84.96 },
                { x: -2056.30, y: -997.48, z: 0.73, h: 83.14 },
                { x: -2145.07, y: -1018.13, z: 1.06, h: 220.34 },
                { x: -2048.47, y: -1083.65, z: 0.49, h: 240.57 },
                { x: -1905.31, y: -1217.47, z: 1.47, h: 233.70 },
                { x: -1791.91, y: -1315.75, z: 0.41, h: 225.87 },
                { x: -1610.32, y: -1529.86, z: 0.75, h: 212.25 },
                { x: -1407.27, y: -1766.21, z: 0.70, h: 227.90 },
                { x: -1383.44, y: -1882.41, z: 0.49, h: 160.41 },
                { x: -1292.32, y: -1940.30, z: 1.56, h: 271.45 },
                { x: -1079.47, y: -1824.29, z: 0.45, h: 300.76 },
                { x: -857.60, y: -1646.74, z: 0.24, h: 315.96 },
                { x: -658.09, y: -1519.93, z: 0.37, h: 282.79 },
                { x: -404.38, y: -1624.21, z: 0.58, h: 223.41 },
                { x: 5.12, y: -1981.17, z: 0.23, h: 231.17 },
                { x: 59.98, y: -2203.30, z: 0.58, h: 182.37 },
                { x: 74.32, y: -2271.56, z: 0.44, h: 230.08 },
                { x: 91.84, y: -2302.09, z: 0.13, h: 153.30 },
                { x: 31.35, y: -2299.58, z: 0.26, h: 5.39 },
                { x: 49.35, y: -2245.15, z: 1.00, h: 336.53 },
                { x: 64.15, y: -2084.87, z: 0.37, h: 1.13 },
                { x: -32.22, y: -1947.64, z: 0.26, h: 50.18 },
                { x: -262.20, y: -1779.08, z: 0.32, h: 56.82 },
                { x: -353.44, y: -1691.70, z: 0.63, h: 37.14 },
                { x: -515.24, y: -1550.93, z: 0.28, h: 60.28 },
                { x: -705.63, y: -1539.81, z: 0.24, h: 111.89 },
                { x: -833.33, y: -1623.69, z: 0.14, h: 134.74 },
                { x: -969.66, y: -1752.97, z: 0.41, h: 130.94 },
                { x: -1036.03, y: -1785.01, z: 0.15, h: 31.14 },
                { x: -1038.74, y: -1758.11, z: 0.45, h: 321.38 },
                { x: -994.38, y: -1705.56, z: 0.56, h: 317.38 },
                { x: -861.70, y: -1591.47, z: 0.31, h: 311.67 },
                { x: -789.28, y: -1494.11, z: 0.12, h: 291.66 }
            ],
            license: [{ id: "boat", cost: 4000, restore: 2000, time: 30, models: ["dinghy3"] }],
            icon: 77,
            name: "Лицензионный центр водного транспорта"
        },
        {
            auto: true,
            point: { x: 441.26, y: -974.85, z: 29.69 },
            start: { x: 13.06, y: -1097.99, z: 29.80, h: 337 },
            points: [
                { x: 21.28, y: -1091.07, z: 28.80, h: 162 },
                { x: 19.82, y: -1090.48, z: 28.80, h: 162 },
                { x: 17.04, y: -1089.37, z: 28.80, h: 162 },
                { x: 14.08, y: -1088.28, z: 28.80, h: 162 },
                { x: 11.45, y: -1087.35, z: 28.80, h: 162 },
                { x: 15.17, y: -1079.06, z: 28.80, h: 162 },
                { x: 17.67, y: -1080.18, z: 28.80, h: 162 },
                { x: 20.43, y: -1081.05, z: 28.80, h: 162 },
                { x: 23.86, y: -1082.21, z: 28.80, h: 162 },
                { x: 25.67, y: -1077.93, z: 28.80, h: 162 },
                { x: 22.82, y: -1076.91, z: 28.80, h: 162 },
                { x: 19.84, y: -1075.88, z: 28.80, h: 162 },
                { x: 16.97, y: -1071.90, z: 28.80, h: 162 },
                { x: 19.59, y: -1072.49, z: 28.80, h: 162 },
                { x: 22.39, y: -1073.44, z: 28.80, h: 162 },
                { x: 26.34, y: -1074.85, z: 28.80, h: 162 }
            ],
            license: [{ id: "weapon", cost: 10000, restore: 5000, time: 30, guns: [501, 502, 503, 504, 505], need_document: 'weapon_theory', need_document_remove: true }],
            // icon: 77,
            name: "Оружейный Лицензионный центр"
        },
        {
            auto: true,
            point: { x: -1153.86, y: -2715.24, z: 18.89 },
            start: { x: -1146.08, y: -2864.58, z: 13.95, h: 150 },
            points: [
                { x: -1173.29, y: -2912.94, z: 37.12, h: 155 },                
                { x: -1260.54, y: -2994.99, z: 69.24, h: 155 },                
                { x: -1476.59, y: -2932.49, z: 121.95, h: 155 },                
                { x: -1511.75, y: -2696.19, z: 131.35, h: 155 },                
                { x: -1402.59, y: -2510.42, z: 119.04, h: 155 },                
                { x: -1135.09, y: -2353.97, z: 95.86, h: 155 },                
                { x: -776.76, y: -2443.27, z: 100.89, h: 155 },                
                { x: -828.45, y: -2888.04, z: 92.53, h: 155 },                
                { x: -808.14, y: -3389.43, z: 143.29, h: 155 },                
                { x: -1217.65, y: -3493.50, z: 128.83, h: 155 },                
                { x: -1583.73, y: -3285.57, z: 105.95, h: 155 },                
                { x: -1978.94, y: -3027.53, z: 99.18, h: 155 },                
                { x: -1719.04, y: -2799.58, z: 115.71, h: 155 },                
                { x: -1328.48, y: -2921.01, z: 63.48, h: 155 },                
                { x: -1207.11, y: -3021.65, z: 13.94, h: 238 },                
            ],
            license: [{ id: "air", cost: 37000, restore: 15000, time: 30, models: ["maverick"] }],
            icon: 77,
            name: "Лицензионный центр воздушного транспорта"
        }
    ]



