import {CASINO_ENTER, CASINO_MAIN_DIMENSION} from "./casino/main";

export const CASINO_TELEPORT_NAME = 'Казино';
export const HOSPITAL_TELEPORT_DIMENSION = 112233;

interface TeleportItem {
    /** Название точки телепортации */
    name: string;
    /** Точки телепортации. Использовать координаты для плоского маркера */
    points: {
        name: string,
        x: number,
        y: number,
        z: number,
        h: number,
        /** Измерение. Если указать -1 - то будет везде, при этом телепорт произойдёт внутри того измерения, в котором находится игрок*/
        d: number
    }[];
    /** Параметр, который указывает на то, что можно телепортироватся только в одном направлении (от первой ко второй точки) */
    oneway?: true;
    /** Параметр, который указывает на то, что телепортация произойдёт сразу при входе в маркер */
    onenter?: true;
    /** Параметр, который указывает на то, что телепортация произойдёт сразу при нажатии на кнопку */
    onenterpress?: true;
    /** Ограничить доступ по фракции */
    fraction?:number | "gang" | "mafia" | "gos";
    /** Взымать плату за телепорт */
    cost?: number;
    /** Позволить телепортироватся транспорту. Радиус маркеров будет увеличен до 4 */
    vehicle?:true;
    /** Настройка параметра ожидания. Если указать - человеку нужно будет подождать какое то время прежде чем его телепортирует */
    wait?: {distance: number, text: string, seconds: number};
    /** Ограничить доступ по семье */
    family?: number;

}

export const TELEPORT_CONFIG: TeleportItem[] = [
    
    {
        name: 'Лифт Army',
        points: 
        [{name: "Лифт Army", x: -2360.89, y: 3249.38, z: 31.81, h: 325, d: 0},{name: "Лифт Army", x: -2360.76, y: 3249.41, z: 91.90, h: 328, d: 0}], 
        onenter: true,
        fraction: 4
    },
    // {
    //     name: 'Крыша EMS',
    //     points: 
    //     [{name: "EMS улица", x: -259.70, y: 6309.45, z: 31.43, h: 304, d: 0},{name: "EMS крыша", x: -251.17, y: 6338.73, z: 36.56, h: 220, d: 0}], 
    //     onenter: true,
    // },
    // {
    //     name: 'Лифт',
    //     points: 
    //     [{name: "Второй этаж", x: 309.69, y: -569.07, z: 42.36, h: 75, d: 0},{name: "Первый этаж", x: 347.93, y: -580.64, z: 27.80, h: 154, d: 0},{name: "EMS крыша", x: 338.97, y: -584.90, z: 73.27, h: 252, d: 0}], 
    //     onenter: true,
    // },
    {
        name: 'Тюрьма',
        points: 
        [{name: "Вход", x: 1846.56, y: 2585.82, z: 44.67, h: 272, d: 0},{name: "Выход", x: 1775.23, y: 2552.15, z: 44.56, h: 91, d: 0}], 
        onenter: true,
        fraction: 7
    },
    {
        name: 'Гаражи',
        points: 
        [{name: "1 этаж", x: 838.89, y: -1311.06, z: -84.71, h: 179, d: -1},{name: "2 этаж", x: 843.53, y: -2049.03, z: -84.71, h: 179, d: -1},{name: "3 этаж", x: 1649.59, y: -1305.16, z: -84.71, h: 359, d: -1},{name: "4 этаж", x: -193.68, y: -1321.40, z: -84.71, h: 349, d: -1}],
        onenter: true
    },
    {
        name: CASINO_TELEPORT_NAME,
        points:
        [
            {name: "Выход из казино", ...CASINO_ENTER, d: 0},
            {name: "Вход в казино", x: 1089.63, y: 206.54, z: -50.00, h: 338, d: CASINO_MAIN_DIMENSION},
        ],
        onenterpress: true
    },
    // Левое крыло фиб
    {
        name: 'Лифт',
        points: 
        [{name: "3й этаж", x: 2504.50, y: -433.22, z: 98.21, h: 316, d: 0}, {name: "4й этаж", x: 2504.42, y: -433.18, z: 106.01, h: 312, d:0},{name: "4й этаж", x: 2497.45, y: -349.18, z: 104.79, h: 313, d: 0}, {name: "Подвал",x: 2491.27, y: -392.06, z: 86.81, h: 44, d:0},{name: "Крыша", x: 2509.84, y: -432.72, z: 117.33, h: 296, d:0}], 
        onenter: true,
        fraction: 3
    },
    // Правое крыло фиб
    {
        name: 'Лифт',
        points: 
        [{name: "Первый этаж", x: 2497.47, y: -348.99, z: 93.19, h: 311, d: 0}, {name: "3й этаж", x: 2494.85, y: -346.96, z: 100.99, h: 311, d:0},{name: "4й этаж", x: 2495.01, y: -346.82, z: 104.79, h: 333, d: 0}, {name: "Подвал",x: 2491.27, y: -392.06, z: 86.81, h: 44, d:0},{name: "Крыша", x: 2505.44, y: -340.60, z: 117.12, h: 168, d: 0}], 
        onenter: true,
        fraction: 3
    },
    {
        name: 'Лифт',
        points: 
        [{name: "Первый этаж", x: 2501.93, y: -339.90, z: 100.99, h: 136, d: 0},{name: "4й этаж", x: 2501.67, y: -340.05, z: 104.79, h: 134, d: 0}, {name: "Подвал",x: 2491.27, y: -392.06, z: 86.81, h: 44, d:0},{name: "Крыша", x: 2505.44, y: -340.60, z: 117.12, h: 168, d: 0}], 
        onenter: true,
        fraction: 3
    },
    {
        name: 'Лифт',
        points: 
        [{name: "Первый этаж", x: 2502.01, y: -339.73, z: 93.19, h: 133, d: 0}, {name: "3й этаж", x: 2504.40, y: -342.22, z: 100.99, h: 129, d:0},{name: "4й этаж", x: 2504.14, y: -342.40, z: 104.79, h: 136, d: 0}, {name: "Подвал",x: 2491.27, y: -392.06, z: 86.81, h: 44, d:0},{name: "Крыша", x: 2505.44, y: -340.60, z: 117.12, h: 168, d: 0}], 
        onenter: true,
        fraction: 3
    },
    {
        name: 'Лифт',
        points: 
        [{name: "Первый этаж", x: 2504.55, y: -342.13, z: 93.19, h: 137, d: 0}, {name: "3й этаж", x: 2497.49, y: -349.05, z: 100.99, h: 310, d:0},{name: "4й этаж", x: 2497.45, y: -349.18, z: 104.79, h: 313, d: 0}, {name: "Подвал",x: 2491.27, y: -392.06, z: 86.81, h: 44, d:0},{name: "Крыша", x: 2505.44, y: -340.60, z: 117.12, h: 168, d: 0}], 
        onenter: true,
        fraction: 3
    },
    // Life Invander
    {
        name: 'Лифт',
        points: 
        [{name: "Первый этаж", x: -590.36, y: -938.31, z: 22.97, h: 357, d: 0}, {name: "2й этаж", x: -590.34, y: -938.39, z: 27.28, h: 351, d:0},{name: "3й этаж", x: -590.29, y: -938.41, z: 31.62, h: 351, d: 0}], 
        onenter: true,
        fraction: 5
    },
    {
        name: 'Лифт',
        points: 
        [{name: "Первый этаж", x: -586.18, y: -938.64, z: 22.96, h: 358, d: 0}, {name: "2й этаж", x: -586.10, y: -938.23, z: 27.28, h: 355, d:0},{name: "3й этаж", x: -586.25, y: -938.48, z: 31.62, h: 356, d: 0}], 
        onenter: true,
        fraction: 5
    },
    {
        name: 'Лифт',
        points: 
        [{name: "Второй этаж", x: -564.61, y: -178.61, z: 41.17, h: 208, d: 0},{name: "Башня", x: -558.15, y: -191.88, z: 69.07, h: 302, d: 0}], 
        onenter: true,
        fraction: 1
    },
    {
        name: 'Лифт',
        points: 
        [{name: "Гараж", x: 461.61, y: -981.54, z: 24.81, h: 89, d: 0},{name: "Первый этаж", x: 463.35, y: -981.57, z: 29.79, h: 90, d: 0},{name: "Второй этаж", x: 463.40, y: -981.72, z: 34.78, h: 102, d: 0},{name: "Крыша", x: 462.60, y: -983.88, z: 42.79, h: 83, d: 0},{name: "Третий этаж", x: 466.02, y: -981.57, z: 39.78, h: 83, d: 0}], 
        onenter: true,
        fraction: 2
    },
    {
        name: 'Лифт больница',
        points: 
        [{name: "Главный вход", x: 309.69, y: -569.07, z: 42.36, h: 75, d: 0},{name: "Палаты", x: 315.18, y: -580.23, z: 86.03, h: 159, d: 0},,{name: "Крыша", x: 338.97, y: -584.90, z: 73.27, h: 252, d: 0},{name: "Первый этаж", x: 347.93, y: -580.64, z: 27.80, h: 154, d: 0}], 
        onenter: true,
    },
];