/**
 * Зоны видимости преступников для возможности отслеживания
 * Указывать крайние координаты прямоугольника
 */
export const wantedViewZones = [
    [
        { x: 1568.34, y: -3585.49},
        { x: -2131.20, y: -1252.95 }
    ],
    [
        { x: -2131.20, y: -1252.95 },
        { x: 1457.52, y: 876.39 }
    ],
    [
        { x: -2482.40, y: -37.20 },
        { x: -3556.23, y: 1529.26 }
    ],
    [
        { x: -411.06, y: 5939.08 },
        { x: 163.43, y: 6868.06 }
    ],
    [
        { x: 1304.71, y: 3655.74 },
        { x: 1459.56, y: 3613.03 }
    ],
    [
        { x: 1408.07, y: 3763.61 },
        { x: 2060.85, y: 3751.83 }
    ]
]